In [1]:
import pandas as pd
import numpy as np
df=pd.read_excel("C:/Users/Pallavi Katuri/Downloads/pandas-Consumer.xlsx")

In [2]:
df.head()

   Income  HouseholdSize  AmountCharged
0      54              3           4016
1      30              2           3159
2      32              4           5100
3      50              5           4742
4      31              2           1864

In [3]:
df.columns

Index(['Income', 'HouseholdSize', 'AmountCharged'], dtype='object')

In [4]:
df.dtypes

Income           int64
HouseholdSize    int64
AmountCharged    int64
dtype: object

In [5]:
df.describe(include=['int64'])

          Income  HouseholdSize  AmountCharged
count  50.000000      50.000000      50.000000
mean   43.480000       3.420000    3964.060000
std    14.550742       1.738989     933.494082
min    21.000000       1.000000    1864.000000
25%    30.250000       2.000000    3130.500000
50%    42.000000       3.000000    4090.000000
75%    54.750000       4.750000    4732.750000
max    67.000000       7.000000    5678.000000

In [6]:
Numeric=df.describe(include=[np.number])
Numeric

          Income  HouseholdSize  AmountCharged
count  50.000000      50.000000      50.000000
mean   43.480000       3.420000    3964.060000
std    14.550742       1.738989     933.494082
min    21.000000       1.000000    1864.000000
25%    30.250000       2.000000    3130.500000
50%    42.000000       3.000000    4090.000000
75%    54.750000       4.750000    4732.750000
max    67.000000       7.000000    5678.000000

In [7]:
df['HouseholdSize']=df['HouseholdSize'].astype(str)

In [8]:
df.describe()

          Income  AmountCharged
count  50.000000      50.000000
mean   43.480000    3964.060000
std    14.550742     933.494082
min    21.000000    1864.000000
25%    30.250000    3130.500000
50%    42.000000    4090.000000
75%    54.750000    4732.750000
max    67.000000    5678.000000

In [9]:
df.dtypes

Income            int64
HouseholdSize    object
AmountCharged     int64
dtype: object

In [10]:
df.describe(include=[np.object,np.number])

           Income HouseholdSize  AmountCharged
count   50.000000            50      50.000000
unique        NaN             7            NaN
top           NaN             2            NaN
freq          NaN            15            NaN
mean    43.480000           NaN    3964.060000
std     14.550742           NaN     933.494082
min     21.000000           NaN    1864.000000
25%     30.250000           NaN    3130.500000
50%     42.000000           NaN    4090.000000
75%     54.750000           NaN    4732.750000
max     67.000000           NaN    5678.000000

In [11]:
df['HouseholdSize'].unique()

array(['3', '2', '4', '5', '1', '6', '7'], dtype=object)

In [12]:
df['HouseholdSize'].value_counts(sort=True)

2    15
4     9
3     8
1     5
5     5
6     5
7     3
Name: HouseholdSize, dtype: int64

In [13]:
df.isnull().sum()

Income           0
HouseholdSize    0
AmountCharged    0
dtype: int64

In [14]:
df.describe()

          Income  AmountCharged
count  50.000000      50.000000
mean   43.480000    3964.060000
std    14.550742     933.494082
min    21.000000    1864.000000
25%    30.250000    3130.500000
50%    42.000000    4090.000000
75%    54.750000    4732.750000
max    67.000000    5678.000000

In [15]:
df.groupby(["HouseholdSize"]).mean()

                  Income  AmountCharged
HouseholdSize
1              34.600000    2781.400000
2              41.533333    3278.266667
3              44.250000    4023.125000
4              48.000000    4486.777778
5              46.800000    4532.800000
6              47.200000    5032.000000
7              40.666667    4910.666667

In [16]:
df['HouseholdSize'].value_counts()

2    15
4     9
3     8
1     5
5     5
6     5
7     3
Name: HouseholdSize, dtype: int64

In [17]:
df.corr()

                 Income  AmountCharged
Income         1.000000       0.630974
AmountCharged  0.630974       1.000000

In [33]:
pd.crosstab('HouseholdSize','HouseholdSize')

ValueError: If using all scalar values, you must pass an index

0     29
1     29
2     29
3     29
4     29
5     29
6     29
7     29
8     29
9     29
10    29
11    29
12    29
13    29
14    29
15    29
16    29
17    29
18    29
19    29
20    29
21    29
22    29
23    29
24    29
25    29
26    29
27    29
28    29
29    29
30    29
31    29
32    29
33    29
34    29
35    29
36    29
37    29
38    29
39    29
40    29
41    29
42    29
43    29
44    29
45    29
46    29
47    29
48    29
49    29
Name: like, dtype: int64